# GetAvailableParameters Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableView..::..GetAvailableParameters Method
TableView Class See Also
---
Gets a list of valid parameters for the specified category that can be used in the table view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static IList<ElementId> GetAvailableParameters(
	Document cda,
	ElementId categoryId
)
```

Visual Basic
---
```text
Public Shared Function GetAvailableParameters ( _
	cda As Document, _
	categoryId As ElementId _
) As IList(Of ElementId)
```

Visual C++
---
```text
public:
static IList<ElementId^>^ GetAvailableParameters(
	Document^ cda,
	ElementId^ categoryId
)
```

# ### Parameters
cda
    Type: Autodesk.Revit.DB..::..Document The document.
categoryId
    Type: Autodesk.Revit.DB..::..ElementId The specified element category id.
# ### Return Value
The IDs of all valid parameters.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TableView Class
Autodesk.Revit.DB Namespace